# CanUseHookType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..CanUseHookType Method
RebarContainerItem Class See Also
---
Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanUseHookType(
	ElementId proposedHookId
)
```

Visual Basic
---
```text
Public Function CanUseHookType ( _
	proposedHookId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CanUseHookType(
	ElementId^ proposedHookId
)
```

# ### Parameters
proposedHookId
    Type: Autodesk.Revit.DB..::..ElementId The Id of the RebarHookType
# ### Return Value
Returns true if the id is of a valid RebarHookType for the Rebar element.
# Remarks
Also, checks that the Style of the Hook matches that of the Rebar's RebarShape
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace